simpleFoam/windAroundBuildings-M/system/decomposeParDict
/*--------------------------------*- C++ -*----------------------------------*\                                                                                                                                                              
  =========                 |  
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6    
     \\/     M anipulation  |  
\*---------------------------------------------------------------------------*/
FoamFile
{   
    version     2.0;
    format      ascii;         
    class       dictionary;    
    location    "system";      
    object      decomposeParDict;   
}   
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

numberOfSubdomains 512;

method          hierarchical;

// Feng doesn't work...
// nz              #calc "($numberOfSubdomains)/4"

hierarchicalCoeffs
{
    n               (8 8 8);
    delta           0.001;
    order           xyz;
}

manualCoeffs
{
    dataFile        "";
}

distributed     no;

roots           ( );


// ************************************************************************* //
